app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "comentario 1 producto 4"], ["user_id", 2], ["product_id", 5], ["created_at", "2018-03-17 16:19:46.195281"], ["updated_at", "2018-03-17 16:19:46.195281"]]
---
	def create
		product = Product.find(params[:product_id])
		product.comments.create(comment_params)