app/controllers/products_controller.rb

	def index
			@products = Product.search(params[:product_name])
---
SELECT "products".* FROM "products" WHERE (name LIKE '%%') ORDER BY created_at DESC

	def create
		@product = Product.new(product_params)
		@product.user = current_user
		if @product.save
---
INSERT INTO "products" ("name", "url", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Producto 4"], ["url", "www.producto4.com"], ["description", ""], ["created_at", "2018-03-17 15:05:17.065072"], ["updated_at", "2018-03-17 15:05:17.065072"], ["user_id", 2]]

	def update
		product = Product.find(params[:id])
		if product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_file_name", "car1.jpg"], ["image_updated_at", "2018-03-18 00:24:59.425840"], ["updated_at", "2018-03-18 00:24:59.774894"], ["id", 5]]

	def destroy
		product = Product.find(params[:id])
		product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 2]]