app/controllers/votes_controller.rb

  def create
    product = Product.find(params[:product_id])
    product.votes.create(user: current_user)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["product_id", 1], ["created_at", "2018-03-17 16:42:47.229785"], ["updated_at", "2018-03-17 16:42:47.229785"]]

  def destroy
    product = Product.find(params[:product_id])
    product.votes.where(user: current_user).take.try(:destroy)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."product_id" = ? AND "votes"."user_id" = 2 LIMIT ?  [["product_id", 1], ["LIMIT", 1]]