app/views/products/index.html.erb

              <span class="upvote-arrow"></span>
              <span class="upvote-count"><%= product.votes.count %></span>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."product_id" = ?  [["product_id", 1]]

            <span class="glyphicon glyphicon-comment"></span>
            <span class="comment-count"><%= product.comments.count %></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]