app/views/products/show.html.erb

          <h2>Votos</h2>
          <% @product.votes.each do |vote| %>
---
SELECT "votes".* FROM "votes" WHERE "votes"."product_id" = ?  [["product_id", 1]]

          <h2>Comentarios</h2>
          <% @product.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]